{
  "portfolio": {
    "title": "Portfolio Site",
    "active": true,
    "omitFromList": false,
    "clientId": "bbi",
    "mobileStatus": "portrait",
    "tags": [""],
    "role": "",
    "year": "",
    "awards": "",
    "type": "",
    "desc": [
      "<p>Obviously, adding your portfolio as one of its own featured pieces risks creating a spacetime feedback loop — but I'm willing to take that chance!</p>",
      "<p>In all seriousness, this portfolio isn't just a showcase of my work; it's a project I built to sharpen my React skills while demonstrating the level of polish I bring to projects.</p>",
      "<p>At its core, this project features a highly flexible carousel component (you're looking at it). While it might seem standard at first glance, it's designed for seamless interactivity with features that make it truly unique. It supports synchronization for parallax effects, native touch and gesture scrolling, and custom inertia-driven drag mechanics powered by GSAP — blending the best of native and enhanced interactions.</p>",
      "<p>Here's a question: have you ever seen a <i>natively accessible</i>, synchronized parallax carousel? Well you haven't been keeping notes on that, but probably not!</p>",
      "<p>And beyond that, it's seamlessly integrated with React Router for dynamic navigation. Try interacting with it, then use your browser's history buttons.</p>",
      "<p>This project is a work in progress. This page runs off of static data, but a Node/Express backend is in the works. And there's a long ways to go still with other site features.</p>",
      "<p>The code repository is public — feel free to check out the documentation for more details. The carousel will have an NPM repo, but I haven't got that far yet.</p>"
    ],
    "date": "",
    "urls": {
      "Code Repo": "https://github.com/BBaysinger/bb-portfolio"
    }
  },
  "slideshow": {
    "title": "Slideshow Component",
    "active": true,
    "omitFromList": false,
    "clientId": "bbi",
    "mobileStatus": "portrait",
    "tags": [""],
    "role": "",
    "year": "",
    "awards": "",
    "type": "",
    "desc": [
      "<p>As mentioned, I've been deepening my experience with React. This project is a reusable React slideshow component with full single-page app (SPA) capabilities, developed as part of a deep dive into React hooks and state management.</p>",
      "<p>Designed with scalability, performance, and accessibility in mind, it features auto-slide functionality, deep linking via dynamic routing, and intuitive user interactions, including pausing, resuming, and manual navigation.</p>",
      "<p>The component is highly configurable — developers can pass in slides as an array of objects containing foreground and background images, thumbnails, and JSX content. It dynamically adjusts its height based on slide content to eliminate excess whitespace, ensuring an elegant layout across devices. Additionally, lazy-loaded images and optimized animations enhance performance for a smooth user experience.</p>",
      "<p>Custom navigation controls are fully supported, with two built-in options available. Developers can also define their own controls and even integrate multiple sets.</p>",
      "<p>More details are available in the code repo. This project is still evolving, with additional features and documentation in progress. It also serves as an example of code quality, so if JavaScript is your thing, take a look at the solutions it implements.</p>"
    ],
    "date": "",
    "urls": {
      "Code Repo": "https://github.com/BBaysinger/bb-react-slideshow",
      "Live Demo": "https://bb-react-slideshow.netlify.app"
    }
  },
  "exas": {
    "title": "Exact Sciences Website",
    "active": true,
    "omitFromList": false,
    "clientId": "exas",
    "mobileStatus": "portrait",
    "tags": [""],
    "role": "",
    "year": "",
    "awards": "",
    "type": "",
    "desc": [
      "<p>Exact Sciences is a leading molecular diagnostics company specializing in early cancer detection and treatment guidance.</p>",
      "<p>At Epsilon, I contributed to the development of the Exact Sciences website within Sitecore, implementing interactive elements, refining styling, resolving defects, and building modular, reusable components to ensure scalability and consistency across the site.</p>",
      "<p>One of my key contributions was an interactive oncology report explorer, designed to help patients and practitioners better understand their diagnostics.</p>"
    ],
    "date": "",
    "urls": {
      "View Site": "https://www.exactsciences.com/"
    }
  },
  "golden1": {
    "title": "Golden 1 Credit Union",
    "active": true,
    "omitFromList": false,
    "clientId": "golden1",
    "mobileStatus": "portrait",
    "tags": [""],
    "role": "",
    "year": "",
    "awards": "",
    "type": "",
    "desc": [
      "<p>I contributed to the Golden1 Credit Union website by developing interactive features such as accordions, global navigation menus, and a card comparison tool—though the latter has become somewhat redundant now that the number of available cards has been reduced to three.</p>",
      "<p>In addition to feature development, I was responsible for optimizing performance, accessibility, and SEO. Using Lighthouse diagnostics, I meticulously audited both the front-end and source code to identify and reduce unused and bloated code, and identify and resolve inefficiencies.</p>",
      "<p>That said, I've noticed a few defects that have crept in since my time on the project—definitely not claiming those, lol.</p>"
    ],
    "date": "",
    "urls": {
      "View Site": "https://www.golden1.com/"
    }
  },
  "citibank": {
    "title": "Citibank Website",
    "active": true,
    "omitFromList": false,
    "clientId": "citibank",
    "mobileStatus": "portrait",
    "tags": ["Angular", "TypeScript", "HTML5", "CSS3", "Responsive"],
    "role": "Developer",
    "year": "",
    "awards": "",
    "type": "",
    "date": "",
    "desc": [
      "<p>I developed a few parts of the Citibank site, including the Citigold Benefits, Compare Cards, and a couple of the Calculators, along with various modals around the site.</p>",
      "<p>The benefits page includes drop-downs, a slider, and tabbed layouts, and a plethora of dynamically populated fields.</p>",
      "<p>The loan and equity calculators use Angular custom components and formulas provided by Citibank.</p>"
    ],
    "urls": {
      "Citigold Benefits": "https://www.citi.com/banking/citigold?intc=citihpmenu_overview_citigold",
      "Compare Cards": "https://www.citi.com/credit-cards/compare/most-popular-credit-cards",
      "Home Equity Calculator": "https://www.citi.com/home-equity/loan-calculator",
      "Home Affordability Calculator": "https://www.citi.com/mortgage/affordability-calculator"
    }
  },
  "abbvie": {
    "title": "Bystolic Email",
    "active": true,
    "omitFromList": false,
    "clientId": "abbvie",
    "mobileStatus": "portrait",
    "tags": ["Email", "Responsive", "Salesforce"],
    "role": "Developer",
    "year": "",
    "awards": "",
    "type": "",
    "date": "",
    "desc": [
      "<p>HTML email development is everyone's favorite, right? Lol, well I embrace any challenge and try to breathe innovation into and improve processes on every project if there's room for it. And there usually is.</p>",
      "<p>At the start, I was surprised that the Salesforce platform didn't have better features. No room for best practices, documentation, version control, or preprocessing. Brand new to email, I took the initiative to develop a system to bring all of that and standardization to the team's workflow.</p>",
      "<p>I also served as a mentor for the new email developers, and moved on to developing email preference centers and workflows in OneTrust.</p>"
    ],
    "urls": {}
  },
  "marioparty": {
    "title": "Super Mario Party",
    "active": true,
    "omitFromList": false,
    "clientId": "nintendo",
    "mobileStatus": "portrait",
    "tags": ["jQuery", "HTML5", "CSS3", "Responsive"],
    "role": "Contributing Developer",
    "year": "",
    "awards": "",
    "type": "",
    "date": "",
    "desc": [
      "<p>I've always been a fan of Mario Bros. games (though my favorites were on the Atari 7800). The mini-games in this one are seriously addictive.</p>",
      "<p>I developed the interactive activity where users search for hidden Toadettes behind various elements on each page. This feature was integrated with Nintendo's microsite API and included multiple overlapping states and flows (disabled for the portfolio) based on user region and status.</p>",
      "<p>I also implemented the 'event space' button—the large green button on each page that delivers a fun little surprise.</p>",
      "<p>Additionally, I was responsible for the video player and various responsive elements throughout the site.</p>",
      "<p>These projects typically operate under tight deadlines, with only 2-3 weeks for development and limited budgets, which influenced the development approach.</p>"
    ],
    "urls": {
      "View Site": "http://www.bbaysinger.com/_projects/marioparty/index.html"
    }
  },
  "bowser": {
    "title": "Bowser's Inside Story",
    "active": true,
    "omitFromList": false,
    "clientId": "nintendo",
    "mobileStatus": "portrait",
    "tags": ["SVG", "jQuery", "HTML5", "CSS3", "Responsive"],
    "role": "Contributing Developer",
    "year": "",
    "awards": "",
    "type": "",
    "date": "",
    "desc": [
      "<p>This Mario Bros. Nintendo DS game site featured a detailed hero animation, which required some intricate CSS3 work. I designed the responsive elements to adapt fluidly without relying on breakpoints, allowing the entire sequence to be scripted only once.</p>",
      "<p>The bounce effects on certain page elements and the rubbery button interactions involved creating a custom system for dynamically animating SVG paths.</p>",
      "<p>Beyond animations, I also contributed to the site's responsive layout and localization.</p>",
      "<p>Interestingly, of the three Nintendo projects in my portfolio, there were some challenges, as a lead was adamant about avoiding modern development practices. I did my best to advocate for better solutions while navigating the constraints diplomatically.</p>"
    ],
    "urls": {
      "View Site": "http://www.bbaysinger.com/_projects/marioandluigi/index.html"
    }
  },
  "ua3": {
    "title": "Ultimate Alliance 3",
    "active": true,
    "omitFromList": false,
    "clientId": "nintendo",
    "mobileStatus": "portrait",
    "tags": ["Canvas", "jQuery", "HTML5", "CSS3", "Responsive"],
    "role": "Contributing Developer",
    "year": "",
    "awards": "",
    "type": "",
    "date": "",
    "desc": [
      "<p>For the latest entry in Marvel's Ultimate Alliance series, I developed the central interactive feature: a wallpaper creator that lets users select characters from the game to generate a personalized image for their phone, computer, or Facebook cover.</p>",
      "<p>Additionally, I worked on canvas animations throughout the site, implemented the main video player, and contributed to the responsive page layout.</p>",
      "<p>Accessibility became a new requirement for Nintendo on this project, which led to the implementation of a 'reduce motion' feature. This setting pauses all animations—whether JavaScript, CSS3, canvas, or video—ensuring a more accessible experience for users with motion sensitivity.</p>"
    ],
    "urls": {
      "View Site": "http://www.bbaysinger.com/_projects/ua3/index.html"
    }
  },
  "cfc": {
    "title": "What is Second Step Landing",
    "active": true,
    "omitFromList": false,
    "clientId": "cfc",
    "mobileStatus": "portrait",
    "tags": ["React", "SVG", "HTML5", "CSS3", "Responsive"],
    "role": "Lead Developer",
    "year": "",
    "awards": "",
    "type": "",
    "date": "",
    "desc": [
      "<p>Committee for Children is an educational charity that reaches over 16.5 million children annually across 70+ countries.</p>",
      "<p>We developed an interactive component to showcase their Second Step program, featuring a multi-layered wheel navigation dynamically rendered using SVG, React, and React Motion.</p>",
      "<p>I took the lead on technical advising, development, and contributed to the project's conceptualization.</p>",
      "<p>Working with SVG in React proved to be incredibly powerful, opening up new possibilities for vector-based rendering and interactivity.</p>",
      "<p>The interactive feature is no longer available on their site, but I'm working on repurposing a functional version.</p>"
    ],
    "urls": {
      "View Site": "https://www.secondstep.org/what-is-second-step"
    }
  },
  "premera": {
    "title": "Merit & Preferred Choice",
    "active": true,
    "omitFromList": false,
    "clientId": "premera",
    "mobileStatus": "portrait",
    "tags": ["jQuery", "HTML5", "CSS3", "Responsive"],
    "role": "Lead Developer",
    "year": "",
    "awards": "",
    "type": "",
    "date": "",
    "desc": [
      "<p>An informational landing page designed to help Premera customers understand their benefits and find the right treatment options.</p>",
      "<p>The page integrates with email marketing campaigns, using query string variables to deep link users to state-specific information.</p>",
      "<p>The original design included a blur effect on the page background when the modal carousel was active. Implementing this across different browsers required some creative problem-solving to ensure consistent support.</p>"
    ],
    "urls": {
      "View Site": "http://www.bbaysinger.com/_projects/premera/wa/index.html?slide-story=one"
    }
  },
  "s2es": {
    "title": "Seven2 Experience Spokane",
    "active": true,
    "omitFromList": false,
    "clientId": "seven2",
    "mobileStatus": "portrait",
    "tags": ["Angular", "TypeScript", "Canvas"],
    "role": "Lead Developer",
    "year": "",
    "awards": "",
    "type": "",
    "date": "",
    "desc": [
      "<p>A promotional site for Seven2, where I had full creative freedom in development. I chose Angular, as it was the framework I was most comfortable with at the time. The project was halted before completion, so some features remain unfinished.</p>",
      "<p>But there are some interesting animations that were created in Adobe Animate and exported for HTML5 canvas. I have extensive experience in animations created this way, and have authored some timeline tools that enable Flash-like interactivity.</p>"
    ],
    "urls": {
      "View Site": "http://www.bbaysinger.com/_projects/s2es/index.html",
      "Code Repo": "https://github.com/BBaysinger/s2-experience-spokane-2018"
    }
  },
  "pushgraph": {
    "title": "USDA Pushgraph",
    "active": true,
    "omitFromList": false,
    "clientId": "usda",
    "mobileStatus": "none",
    "tags": ["Angular", "TypeScript", "Responsive"],
    "role": "Developer/Designer",
    "year": "",
    "awards": "",
    "type": "",
    "date": "",
    "desc": [
      "<p>Pushgraph is an advanced data analysis tool developed by ChalkLabs, leveraging semantics to identify patterns, redundancies, and similarities in research data. It was widely used by government agencies, helping to save the federal government billions of dollars annually.</p>",
      "<p>I designed the UI for the 2017 iteration, which was a significant overhaul of previous versions. This version was entirely built around an Angular-based drag-and-drop widget dashboard that I designed and developed.</p>",
      "<p>As no screenshots are available, the image shown is a rough design used as the foundation for development. Due to the highly secure nature of Pushgraph and other ChalkLabs software, there are no live demos. Please review the project reel for a better sense of the final implementation.</p>"
    ],
    "urls": {
      "Watch Reel": "https://www.youtube.com/watch?v=Fr5IigbR36A",
      "Company Website": "https://chalklabs.com/"
    }
  },
  "calc": {
    "title": "Data Calculator",
    "active": true,
    "omitFromList": true,
    "clientId": "att",
    "mobileStatus": "none",
    "tags": ["jQuery", "RequireJS", "AMD"],
    "role": "Lead developer",
    "year": "",
    "awards": "",
    "type": "Utility",
    "date": "",
    "desc": [
      "<p>A JavaScript web app designed for AT&T Wireless customers to estimate their data usage and choose the most suitable plan. This was one of several data usage calculators we developed for AT&T.</p>",
      "<p>This version predates AT&T's transition to responsive design, so the page was built as a fixed-width layout.</p>",
      "<p>Over the years, I worked on countless AT&T projects, many of which have since become legacy tech as the company evolved its platforms and offerings.</p>"
    ],
    "urls": {
      "View Site": "http://www.bbaysinger.com/_projects/data-calculator/"
    }
  },
  "share": {
    "title": "Mobile Share Planner",
    "active": true,
    "omitFromList": false,
    "clientId": "att",
    "mobileStatus": "none",
    "tags": ["jQuery", "RequireJS", "AMD"],
    "role": "Lead developer",
    "year": "",
    "awards": "",
    "type": "Utility",
    "date": "",
    "desc": [
      "<p>A JavaScript web app designed for AT&T Wireless customers to estimate data usage across multiple devices and select the most suitable plans. Clicking the 'Estimate my monthly usage in detail' links reveals an additional layer of complexity within the tool. This was one of several data usage calculators we developed for AT&T.</p>",
      "<p>This version predates AT&T's transition to responsive design, so the page was built as a fixed-width layout.</p>",
      "<p>Throughout my time working with AT&T, I contributed to numerous projects, many of which have since become legacy as the company modernized its platforms and technology.</p>"
    ],
    "urls": {
      "View Site": "http://www.bbaysinger.com/_projects/mobile-share/"
    }
  },
  "bikini-bottom": {
    "title": "Bikini Bottom Buddy Search",
    "active": true,
    "omitFromList": false,
    "clientId": "nick",
    "mobileStatus": "landscape",
    "tags": ["Haxe", "Game Framework", "Multi-Platform"],
    "role": "Lead Developer",
    "year": "",
    "awards": "",
    "type": "Search",
    "date": "",
    "desc": [
      "<p>A Where's-Waldo-type game with different clues and play style on each level. This would take some time to play through to the good stuff, so I activated a cheat so you can play any one of the five levels.</p>",
      "<p>Though you might expect each level to progress in difficulty, instead these tend to progress in reward of each preceding play style, with the final level being the most fun. Drive the submarine around, and use radar to locate the characters.</p>"
    ],
    "urls": {
      "Play Game": "http://www.bbaysinger.com/_projects/poster/index.html?flambe=html&unlockall",
      "Walkthrough": "https://www.youtube.com/watch?v=ZMkjbYGICcw"
    }
  },
  "tomato": {
    "title": "Expiration Date",
    "active": true,
    "omitFromList": false,
    "clientId": "addicting",
    "mobileStatus": "landscape",
    "tags": ["Haxe", "Game Framework", "Multi-Platform"],
    "role": "Lead Developer",
    "year": "",
    "awards": "",
    "type": "Escape",
    "date": "",
    "desc": [
      "<p>A Where's-Waldo-style game featuring unique clues and play mechanics on each level. To save time, I activated a cheat that allows you to jump directly to any of the five levels.</p>",
      "<p>Rather than simply increasing in difficulty, each level builds upon and enhances the gameplay style of the previous ones, leading to a more rewarding experience. The final level is the most fun—drive a submarine and use radar to locate the hidden characters.</p>"
    ],
    "urls": {
      "Walkthrough": "https://www.youtube.com/watch?v=n2R0WPWcdWM",
      "Play Game": "http://www.bbaysinger.com/_projects/tomato/index.html?flambe=html"
    }
  },
  "trivia": {
    "title": "Ultimate Trivia",
    "active": true,
    "omitFromList": false,
    "clientId": "nick",
    "mobileStatus": "landscape",
    "tags": ["Haxe", "Game Framework", "Multi-Platform"],
    "role": "Lead Developer",
    "year": "2016",
    "awards": "",
    "type": "Trivia",
    "date": "",
    "desc": [
      "<p>A Nickelodeon trivia game featuring over two thousand possible questions, including multimedia-based challenges.</p>",
      "<p>I developed the entire game, aside from contributions by animators.</p>"
    ],
    "urls": {
      "Walkthrough": "https://www.youtube.com/watch?v=-kTV1QPDJ2Y",
      "Play Game": "http://bbaysinger.com/_projects/trivia/index.html?flambe=html"
    }
  },
  "mix-match": {
    "title": "Mix n' Match Dress-Up",
    "active": true,
    "omitFromList": false,
    "clientId": "nickjr",
    "mobileStatus": "none",
    "tags": ["Flash", "AS3"],
    "role": "Lead Developer",
    "year": "",
    "awards": "",
    "type": "",
    "date": "",
    "desc": [
      "<p>Two dress-up games in one! This was Seven2's first game for the Nickelodeon Group. The match mode is a real challenge—you could say I've mastered it over the years.</p>",
      "<p>I developed a custom drag-and-drop system for this project, which I later ported to ActionScript 3.0 and eventually Haxe. I built most of the game, aside from Blue and Magenta's animations and the end screen. Fun fact: that old alarm clock still keeps perfect time after all these years.</p>",
      "<p>This project won the Golden Pixel Addy Award in 2008.</p>",
      "<p>Originally built in Flash before Apple put an end to it, I'm still exploring ways to provide a working version. For now, please enjoy the walkthrough.</p>"
    ],
    "urls": {
      "Walkthrough": "https://www.youtube.com/watch?v=DhvAuTsJq5o"
    }
  },
  "template": {
    "title": "",
    "active": false,
    "omitFromList": false,
    "clientId": "",
    "mobileStatus": "none",
    "tags": [""],
    "role": "",
    "year": "",
    "awards": "",
    "type": "",
    "desc": ["<p>Some HTML.</p>"],
    "date": "",
    "urls": {
      "Walkthroughs:": ["some/url.html", "some/url.html"],
      "View Site": "some/url.html",
      "Play Game": "some/url.html"
    }
  }
}
