{
  "portfolio": {
    "title": "Portfolio Site",
    "active": true,
    "omitFromList": false,
    "clientId": "bbi",
    "mobileStatus": "portrait",
    "tags": [""],
    "role": "",
    "year": "",
    "awards": "",
    "type": "",
    "desc": [
      "<p>Obviously, you can't put your portfolio in your own portfolio without subjecting the spacetime continuum to a feedback loop, but fortunately, I'm not trying to avoid that. In all seriousness, this portfolio is not just a showcase of my work—it's a project I built to deepen my experience with React and modern front-end architecture, and to show the level of polish I can put into projects.</p>",
      "<p>At its core, it features a highly flexible carousel component (you're looking at it), designed for seamless interactivity. This carousel supports dynamic routing, browser-native gesture-based navigation, and synchronization with multiple carousels for unique effects, including parallaxing. This is best experienced with a laptop/trackpad or touchscreen. (I'll later add click/drag support for a similar experience for mouse/pointer input.)</p>",
      "<p>This project is a long way from complete. It has a Node/Express backend comming that I started a while back, and enumerable features and enhancements that I'm always brainstorming. (But I'm already thinking about my <i>next</i> portfolio, which will be massively different but will borrow a few features from here.)</p>",
      "<p>The repo is public, and you can take a gander at the documentation there for more info.</p>"
    ],
    "date": "",
    "urls": {
      "Code Repo": "https://github.com/BBaysinger/bb-portfolio"
    }
  },
  "slideshow": {
    "title": "Slideshow Component",
    "active": true,
    "omitFromList": false,
    "clientId": "bbi",
    "mobileStatus": "portrait",
    "tags": [""],
    "role": "",
    "year": "",
    "awards": "",
    "type": "",
    "desc": [
      "<p>As mentioned, I've been deepening my experience with React. This is a reusable React slideshow component with full SPA (single-page app) features that I developed for, among other things, a deep dive into React hooks and state management.</p>",
      "<p>Designed with scalability, performance, and accessibility in mind, it supports auto-slide functionality, deep linking via dynamic routing, and intuitive user interactions such as pausing, resuming, and manual navigation.</p>",
      "<p>The component is highly configurable, allowing developers to pass in slides as an array of objects containing foreground and background images, thumbnails, and JSX content. It dynamically adjusts its height based on slide content to eliminate excess whitespace, ensuring an elegant layout across devices. Additionally, it integrates lazy-loaded images and optimized animations to deliver a smooth experience with minimal performance overhead.</p>",
      "<p>It also supports custom navigation controls. There are two options out of the box, plus you can make your own and even add multiple sets.</p>",
      "<p>There's more info in the repo. It's still pretty new, so there's more to come in the build and documentation. It's an example of code quality, so if JavaScript is your thing, please take a gander at the solutions it contains in the repo.</p>"
    ],
    "date": "",
    "urls": {
      "Code Repo": "https://github.com/BBaysinger/bb-react-slideshow",
      "Live Demo": "https://bb-react-slideshow.netlify.app"
    }
  },
  "exas": {
    "title": "Exact Sciences Website",
    "active": true,
    "omitFromList": false,
    "clientId": "exas",
    "mobileStatus": "portrait",
    "tags": [""],
    "role": "",
    "year": "",
    "awards": "",
    "type": "",
    "desc": ["<p>Some HTML.</p>"],
    "date": "",
    "urls": {
      "View Site": "some/url.html"
    }
  },
  "golden1": {
    "title": "Golden 1 Credit Union",
    "active": true,
    "omitFromList": false,
    "clientId": "golden1",
    "mobileStatus": "portrait",
    "tags": [""],
    "role": "",
    "year": "",
    "awards": "",
    "type": "",
    "desc": ["<p>Some HTML.</p>"],
    "date": "",
    "urls": {
      "View Site": "some/url.html"
    }
  },
  "citibank": {
    "title": "Citibank Website",
    "active": true,
    "omitFromList": false,
    "clientId": "citibank",
    "mobileStatus": "portrait",
    "tags": ["Angular", "TypeScript", "HTML5", "CSS3", "Responsive"],
    "role": "Developer",
    "year": "",
    "awards": "",
    "type": "",
    "date": "",
    "desc": [
      "<p>I developed a few parts of the Citibank site, including the Citigold Benefits, Compare Cards, and a couple of thes Calculators, along with various modals around the site.</p>",
      "<p>The benefits page includes drop-downs, a slider, and tabbed layouts, and a plethora of dynamicaly populated fields.</p>",
      "<p>The loan and equity calculators use Angular custom components and formulas provided by Citibank.</p>"
    ],
    "urls": {
      "Citigold Benefits": "https://www.citi.com/banking/citigold?intc=citihpmenu_overview_citigold",
      "Compare Cards": "https://www.citi.com/credit-cards/compare/most-popular-credit-cards",
      "Home Equity Calculator": "https://www.citi.com/home-equity/loan-calculator",
      "Home Affordability Calculator": "https://www.citi.com/mortgage/affordability-calculator"
    }
  },
  "abbvie": {
    "title": "Bystolic Email",
    "active": true,
    "omitFromList": false,
    "clientId": "abbvie",
    "mobileStatus": "portrait",
    "tags": ["Email", "Responsive", "Salesforce"],
    "role": "Developer",
    "year": "",
    "awards": "",
    "type": "",
    "date": "",
    "desc": [
      "<p>HTML email development is everyone's favorite, right? Lol, well I embrace any challenge and try to breathe innovation into and improve processes on every project if there's room for it. And there usually is.</p>",
      "<p>At the start, I was surprised that the Salesforce platform didn't have better features. No room for best practices, documentation, version control, or preprocessing. Brand new to email, I took the initiative to develop a system to bring all of that and standardization to the team's workflow.</p>",
      "<p>I also served as a mentor for the new email developers, and moved on to developing email preference centers and workflows in OneTrust.</p>"
    ],
    "urls": {}
  },
  "marioparty": {
    "title": "Super Mario Party",
    "active": true,
    "omitFromList": false,
    "clientId": "nintendo",
    "mobileStatus": "portrait",
    "tags": ["jQuery", "HTML5", "CSS3", "Responsive"],
    "role": "Contributing Developer",
    "year": "",
    "awards": "",
    "type": "",
    "date": "",
    "desc": [
      "<p>I'm forever a fan of Mario Bros games (though my favorite was for the Atari 7800). The mini-games in this one are addicting.</p>",
      "<p>I built the activity, which involves finding all of the Toadettes hiding behind elements on each page. It was integrated with Nintendo's microsite API, and has overlapping flow/states (disabled for portfolio) depending on user region and status.</p>",
      "<p>I integrated the 'event space' button and its effects. It's the big green button on each page that has a little random surprise for you.</p>",
      "<p>I was also responsible for the video player, and various responsive elements around the site.</p>",
      "<p>The nature of these projects is that there are only 2-3 weeks for development, and budgets are tight, so that's why they are developed the way they are.</p>"
    ],
    "urls": {
      "View Site": "http://www.bbaysinger.com/_projects/marioparty/index.html"
    }
  },
  "bowser": {
    "title": "Bowser's Inside Story",
    "active": true,
    "omitFromList": false,
    "clientId": "nintendo",
    "mobileStatus": "portrait",
    "tags": ["SVG", "jQuery", "HTML5", "CSS3", "Responsive"],
    "role": "Contributing Developer",
    "year": "",
    "awards": "",
    "type": "",
    "date": "",
    "desc": [
      "<p>This Mario Bros Nintendo DS game site involved some tedious CSS3 in the hero animation, where I built the responsive elements largely without breakpoints, so the entire sequence only needed to be scripted once.</p>",
      "<p>The bounce effect seen in certain page elements, and the rubber buttons involved contriving a system for dynamically animating SVG paths.</p>",
      "<p>I also helped out on animation, responsive layout, and localization throughout the site.</p>"
    ],
    "urls": {
      "View Site": "http://www.bbaysinger.com/_projects/marioandluigi/index.html"
    }
  },
  "ua3": {
    "title": "Ultimate Alliance 3",
    "active": true,
    "omitFromList": false,
    "clientId": "nintendo",
    "mobileStatus": "portrait",
    "tags": ["Canvas", "jQuery", "HTML5", "CSS3", "Responsive"],
    "role": "Contributing Developer",
    "year": "",
    "awards": "",
    "type": "",
    "date": "",
    "desc": [
      "<p>In the latest from Marvel's Ultimate Alliance series, I built the central activity, a wallpaper creator where you can choose from the characters in the game for a personalized image for your phone, computer, or Facebook cover.</p>",
      "<p>I also worked with canvas animations throughout, the main video player, and some responsive page layout.</p>",
      "<p>Accessibility was a new requirement for Nintendo, and necessitated a 'reduce motion' feature that pauses animation everywhere, whether it be JavaScript, CSS3, canvas, or video.</p>"
    ],
    "urls": {
      "View Site": "http://www.bbaysinger.com/_projects/ua3/index.html"
    }
  },
  "cfc": {
    "title": "What is Second Step Landing",
    "active": true,
    "omitFromList": false,
    "clientId": "cfc",
    "mobileStatus": "portrait",
    "tags": ["React", "SVG", "HTML5", "CSS3", "Responsive"],
    "role": "Lead Developer",
    "year": "",
    "awards": "",
    "type": "",
    "date": "",
    "desc": [
      "<p>Committee for Children is an educational charity reaching more than 16.5 million children worldwide each year in 70+ countries.</p>",
      "<p>We developed an interactive component to provide information about their Second Step program, which consists of a multi-layered wheel navigation, dynamically rendered using SVG, React, and React Motion.</p>",
      "<p>I took the lead on technical advising, development, and contributed to conceptualization.</p>",
      "<p>Dynamic control of SVG in React proved powerful as it revealed to me new possibilities with vector rendering and interactivity.</p>",
      "<p>The interactive project is no longer on their site. I'm working on repurposing a working version.</p>"
    ],
    "urls": {
      "View Site": "https://www.secondstep.org/what-is-second-step"
    }
  },
  "premera": {
    "title": "Merit & Preferred Choice",
    "active": true,
    "omitFromList": false,
    "clientId": "premera",
    "mobileStatus": "portrait",
    "tags": ["jQuery", "HTML5", "CSS3", "Responsive"],
    "role": "Lead Developer",
    "year": "",
    "awards": "",
    "type": "",
    "date": "",
    "desc": [
      "<p>An informational landing page to help Premera customers understand their benefits and where to get treated.</p>",
      "<p>From email marketing, the page deep links into different states, via query string variables.</p>",
      "<p>The original design called for a blur effect applied to the page underlying the modal carousel, which required some trickery in support for different browsers.</p>"
    ],
    "urls": {
      "View Site": "http://www.bbaysinger.com/_projects/premera/wa/index.html?slide-story=one"
    }
  },
  "s2es": {
    "title": "Seven2 Experience Spokane",
    "active": true,
    "omitFromList": false,
    "clientId": "seven2",
    "mobileStatus": "portrait",
    "tags": ["Angular", "TypeScript", "Canvas"],
    "role": "Lead Developer",
    "year": "",
    "awards": "",
    "type": "",
    "date": "",
    "desc": [
      "<p>A promotional site for Seven2 where I had the liberty of developing in whichever way I felt comfortable. I chose Angular as it was most familiar to me. Not all of the features are complete, as the project was stopped before completion.</p>",
      "<p>This is an extremely simple project in contrast to Angular work I did with ChalkLabs. I've included it here as it's one of the only Angular/TypeScript projects I can present source publicly.</p>"
    ],
    "urls": {
      "View Site": "http://www.bbaysinger.com/_projects/s2es/index.html",
      "Code Repo": "https://github.com/BBaysinger/s2-experience-spokane-2018"
    }
  },
  "pushgraph": {
    "title": "USDA Pushgraph",
    "active": true,
    "omitFromList": false,
    "clientId": "usda",
    "mobileStatus": "none",
    "tags": ["Angular", "TypeScript", "Responsive"],
    "role": "Developer/Designer",
    "year": "",
    "awards": "",
    "type": "",
    "date": "",
    "desc": [
      "<p>The Pushgraph application is innovative software from ChalkLabs that uses semantics to analyze data and find similarities and redudancies. It was used by several government agencies for analyzing research nationwide, saving the federal government billions every year.</p>",
      "<p>I designed the 2017 iteration UI of this software, which was a major rework over previous versions. The entirety of this version is delivered through an Angular drag/drop widget dashboard I designed and developed.</p>",
      "<p>As a screenshot is no longer available, this is of a rough design, which was all that was required to start development. All instances of Pushgraph (and other software I developed at ChalkLabs) are highly secure, and there are no live demos. Please review the reel to get a feel for how the project turned out.</p>"
    ],
    "urls": {
      "Watch Reel": "https://www.youtube.com/watch?v=Fr5IigbR36A",
      "Company Website": "https://chalklabs.com/"
    }
  },
  "calc": {
    "title": "Data Calculator",
    "active": true,
    "omitFromList": true,
    "clientId": "att",
    "mobileStatus": "none",
    "tags": ["jQuery", "RequireJS", "AMD"],
    "role": "Lead developer",
    "year": "",
    "awards": "",
    "type": "Utility",
    "date": "",
    "desc": [
      "<p>A JavaScript web app for AT&T Wireless customers to estimate data usage, and select an appropriate plan. This is one of a few data usage calculators we developed for AT&T.</p>",
      "<p>This is a non-responsive page, as this iteration is from before AT&T delivered on responsive technology.</p>"
    ],
    "urls": {
      "View Site": "http://www.bbaysinger.com/_projects/data-calculator/"
    }
  },
  "share": {
    "title": "Mobile Share Planner",
    "active": true,
    "omitFromList": false,
    "clientId": "att",
    "mobileStatus": "none",
    "tags": ["jQuery", "RequireJS", "AMD"],
    "role": "Lead developer",
    "year": "",
    "awards": "",
    "type": "Utility",
    "date": "",
    "desc": [
      "<p>A JavaScript web app for AT&T Wireless customers to estimate data usage between multiple devices, and select appropriate plans. Click on the 'Estimate my monthly usage in detail' links to view a hidden layer of complexity. This is one of a few data usage calculators we developed for AT&T.</p>",
      "<p>This is a non-responsive page, as this iteration is from before AT&T delivered on responsive technology.</p>"
    ],
    "urls": {
      "View Site": "http://www.bbaysinger.com/_projects/mobile-share/"
    }
  },
  "bikini-bottom": {
    "title": "Bikini Bottom Buddy Search",
    "active": true,
    "omitFromList": false,
    "clientId": "nick",
    "mobileStatus": "landscape",
    "tags": ["Haxe", "Game Framework", "Multi-Platform"],
    "role": "Lead Developer",
    "year": "",
    "awards": "",
    "type": "Search",
    "date": "",
    "desc": [
      "<p>A Where's-Waldo-type game with different clues and play style on each level. This would take some time to play through to the good stuff, so I activated a cheat so you can play any one of the five levels.</p>",
      "<p>Though you might expect each level to progress in difficulty, instead these tend to progress in reward of each preceding play style, with the final level being the most fun. Drive the submarine around, and use radar to locate the characters.</p>"
    ],
    "urls": {
      "Play Game": "http://www.bbaysinger.com/_projects/poster/index.html?flambe=html&unlockall",
      "Walkthrough": "https://www.youtube.com/watch?v=ZMkjbYGICcw"
    }
  },
  "tomato": {
    "title": "Expiration Date",
    "active": true,
    "omitFromList": false,
    "clientId": "addicting",
    "mobileStatus": "landscape",
    "tags": ["Haxe", "Game Framework", "Multi-Platform"],
    "role": "Lead Developer",
    "year": "",
    "awards": "",
    "type": "Escape",
    "date": "",
    "desc": [
      "<p>A post-apocalyptic escape game. We've all been nuked, but you lived and your DNA has combined with that of a tomato. If you think that's freaky, just wait until you see the rest of the house! Watch out for Mom, she's quite upset with you.</p>",
      "<p>I produced the framework for the game and a logic system for all of the interactive elements to work with each other. At a glance, I could see that implementing 'if' statements dispersed around the site could be messy and hard to debug, so I devised a system that employs a single XML document to contain game state, define interactive elements, and how they behave with respect to each other.</p>"
    ],
    "urls": {
      "Walkthrough": "https://www.youtube.com/watch?v=n2R0WPWcdWM",
      "Play Game": "http://www.bbaysinger.com/_projects/tomato/index.html?flambe=html"
    }
  },
  "trivia": {
    "title": "Ultimate Trivia",
    "active": true,
    "omitFromList": false,
    "clientId": "nick",
    "mobileStatus": "landscape",
    "tags": ["Haxe", "Game Framework", "Multi-Platform"],
    "role": "Lead Developer",
    "year": "2016",
    "awards": "",
    "type": "Trivia",
    "date": "",
    "desc": [
      "<p>A trivia game to test your Nickelodeon knowledge with over two thousand possible questions, some of them multimedia.</p>",
      "<p>I built this game in its entirety, minus some animations.</p>"
    ],
    "urls": {
      "Walkthrough": "https://www.youtube.com/watch?v=-kTV1QPDJ2Y",
      "Play Game": "http://bbaysinger.com/_projects/trivia/index.html?flambe=html"
    }
  },
  "mix-match": {
    "title": "Mix n' Match Dress-Up",
    "active": true,
    "omitFromList": false,
    "clientId": "nickjr",
    "mobileStatus": "none",
    "tags": ["Flash", "AS3"],
    "role": "Lead Developer",
    "year": "",
    "awards": "",
    "type": "",
    "date": "",
    "desc": [
      "<p>Two dress-up games in one. This was Seven2's first game for the Nickelodeon Group. That match mode is a true test. You could say I've become a master over the years.</p>",
      "<p>I programmed a drag-drop system that I eventually ported over into ActionScript 3.0, and then Haxe. I built most of the game, minus Blue and Magenta's animations, and the end screen. It's good to see that old alarm clock still keeps good time after all these years.</p>",
      "<p>This project was the recipient of the Golden Pixel Addy Award in 2008.</p>",
      "<p>This project was built in Flash before Apple killed it. I'm still trying to find a way to provide a working example. For now please enjoy the walkthrough.</p>"
    ],
    "urls": {
      "Walkthrough": "https://www.youtube.com/watch?v=DhvAuTsJq5o"
    }
  },
  "template": {
    "title": "",
    "active": false,
    "omitFromList": false,
    "clientId": "",
    "mobileStatus": "none",
    "tags": [""],
    "role": "",
    "year": "",
    "awards": "",
    "type": "",
    "desc": ["<p>Some HTML.</p>"],
    "date": "",
    "urls": {
      "Walkthroughs:": ["some/url.html", "some/url.html"],
      "View Site": "some/url.html",
      "Play Game": "some/url.html"
    }
  }
}
